webapp-osgeo-live/src/main/webapp/static/examples/sos_v20/requests_soap/Transactional/InsertObservation_SweArray.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope http://www.w3.org/2003/05/soap-envelope/soap-envelope.xsd">
	<env:Body>
		<sos:InsertObservation service="SOS" version="2.0.0" 
			xmlns:sos="http://www.opengis.net/sos/2.0"
			xmlns:swes="http://www.opengis.net/swes/2.0" 
			xmlns:swe="http://www.opengis.net/swe/2.0"
			xmlns:sml="http://www.opengis.net/sensorML/1.0.1" 
			xmlns:gml="http://www.opengis.net/gml/3.2"
			xmlns:xlink="http://www.w3.org/1999/xlink" 
			xmlns:om="http://www.opengis.net/om/2.0"
			xmlns:sams="http://www.opengis.net/samplingSpatial/2.0" 
			xmlns:sf="http://www.opengis.net/sampling/2.0"
			xsi:schemaLocation="http://www.opengis.net/sos/2.0 http://schemas.opengis.net/sos/2.0/sos.xsd
											http://www.opengis.net/samplingSpatial/2.0 http://schemas.opengis.net/samplingSpatial/2.0/spatialSamplingFeature.xsd">
			<!-- multiple offerings are possible -->
			<sos:offering>http://www.52north.org/test/offering/9</sos:offering>
			<sos:observation>
				<om:OM_Observation gml:id="o1">
					<om:type xlink:href="http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_SWEArrayObservation"/>
					<om:phenomenonTime>
						<gml:TimePeriod gml:id="phenomenonTime">
							<gml:beginPosition>2012-11-19T13:30:00+02:00</gml:beginPosition>
							<gml:endPosition>2012-11-19T13:44:00+02:00</gml:endPosition>
						</gml:TimePeriod>
					</om:phenomenonTime>
					<om:resultTime>
						<gml:TimeInstant gml:id="resultTime">
							<gml:timePosition>2012-11-19T13:50:00+02:00</gml:timePosition>
						</gml:TimeInstant>
					</om:resultTime>
					<om:procedure xlink:href="http://www.52north.org/test/procedure/9"/>
					<om:observedProperty xlink:href="http://www.52north.org/test/observableProperty/9_7"/>
					<om:featureOfInterest>
						<sams:SF_SpatialSamplingFeature gml:id="ssf_test_feature_9"> 
							<gml:identifier codeSpace="">http://www.52north.org/test/featureOfInterest/9</gml:identifier> 
							<gml:name>52°North</gml:name>
							<sf:type xlink:href="http://www.opengis.net/def/samplingFeatureType/OGC-OM/2.0/SF_SamplingPoint"/> 
							<sf:sampledFeature xlink:href="http://www.52north.org/test/featureOfInterest/1"/> 
							<sams:shape> 
								<gml:Point gml:id="test_feature_9"> 
									<gml:pos srsName="http://www.opengis.net/def/crs/EPSG/0/4326">51.935101100104916 7.651968812254194</gml:pos> 
								</gml:Point> 
							</sams:shape> 
						</sams:SF_SpatialSamplingFeature>
					</om:featureOfInterest>
					<om:result xsi:type="swe:DataArrayPropertyType">
						<swe:DataArray>
							<swe:elementCount>
								<swe:Count>
									<swe:value>15</swe:value>
								</swe:Count>
							</swe:elementCount>
							<swe:elementType name="defs">
								<swe:DataRecord>
									<swe:field name="phenomenonTime">
										<swe:Time definition="http://www.opengis.net/def/property/OGC/0/PhenomenonTime">
											<swe:uom xlink:href="http://www.opengis.net/def/uom/ISO-8601/0/Gregorian"/>
										</swe:Time>
									</swe:field>
									<swe:field name="test_observable_property_6">
										<swe:Quantity definition="http://www.52north.org/test/observableProperty/9_7">
											<swe:uom code="test_unit_6"/>
										</swe:Quantity>
									</swe:field>
								</swe:DataRecord>
							</swe:elementType>
							<swe:encoding>
								<swe:TextEncoding tokenSeparator="#" blockSeparator="@"/>
							</swe:encoding>
							<swe:values>
								2012-11-19T13:30:00+02:00#159.15@2012-11-19T13:31:00+02:00#159.15@2012-11-19T13:32:00+02:00#159.85@2012-11-19T13:33:00+02:00#160.5@2012-11-19T13:34:00+02:00#160.9@2012-11-19T13:35:00+02:00#160.7@2012-11-19T13:36:00+02:00#160.5@2012-11-19T13:37:00+02:00#160.6@2012-11-19T13:38:00+02:00#160.5@2012-11-19T13:39:00+02:00#160.4@2012-11-19T13:40:00+02:00#160.34@2012-11-19T13:41:00+02:00#160.25@2012-11-19T13:42:00+02:00#159.79@2012-11-19T13:43:00+02:00#159.56@2012-11-19T13:44:00+02:00#159.25
							</swe:values>
						</swe:DataArray>
					</om:result>
				</om:OM_Observation>
			</sos:observation>
		</sos:InsertObservation>
	</env:Body>
</env:Envelope>
